//============================================
//
// オブジェクト2Dのメイン処理[object2D.cpp]
// Author：小原立暉
//
//============================================
//********************************************
// インクルードファイル
//********************************************
#include "objectScroll.h"
#include "renderer.h"
#include "manager.h"

//===========================================
// コンストラクタ
//===========================================
CScroll::CScroll() : CObject2D(CObject::TYPE_NONE, CObject::PRIORITY_BG)
{
	// コンストラクタの箱
	Box();
}

//===========================================
// オーバーロードコンストラクタ
//===========================================
CScroll::CScroll(CObject::TYPE type, PRIORITY priority) : CObject2D(type, priority)
{
	// コンストラクタの箱
	Box();
}

//===========================================
// デストラクタ
//===========================================
CScroll::~CScroll()
{

}

//===========================================
// コンストラクタの箱
//===========================================
void CScroll::Box(void)
{
	// 全ての値をクリアする
	m_tex = D3DXVECTOR2(0.0f, 0.0f);	// テクスチャ座標
	m_speed = D3DXVECTOR2(0.0f, 0.0f);	// 速度
}

//===========================================
// 初期化処理
//===========================================
HRESULT CScroll::Init(void)
{
	// 初期化
	if (FAILED(CObject2D::Init()))
	{ // 失敗した場合

		// 失敗を返す
		return E_FAIL;
	}

	// 全ての値を初期化する
	m_tex = D3DXVECTOR2(0.0f, 0.0f);	// テクスチャ
	m_speed = D3DXVECTOR2(0.0f, 0.0f);	// 速度

	// 成功を返す
	return S_OK;
}

//===========================================
// 終了処理
//===========================================
void CScroll::Uninit(void)
{
	// 終了
	CObject2D::Uninit();
}

//===========================================
// 更新処理
//===========================================
void CScroll::Update(void)
{
	// 移動量を加算する
	m_tex.x += m_speed.x;
	m_tex.y += m_speed.y;

	if (m_tex.x >= BG_MAX)
	{ // 背景が一番奥まで行った場合

	  // 背景を0に戻す
		m_tex.x = BG_INIT;
	}

	if (m_tex.y >= BG_MAX)
	{ // 背景が一番奥まで行った場合

	  // 背景を0に戻す
		m_tex.y = BG_INIT;
	}

	// 頂点情報の設定処理
	SetVertex();

	// テクスチャの設定処理(スクロールバージョン)
	SetVtxTextureScroll(m_tex);
}

//===========================================
// 描画処理
//===========================================
void CScroll::Draw(void)
{
	// 描画処理
	CObject2D::Draw();
}

//===========================================
// テクスチャの設定処理
//===========================================
void CScroll::SetTex(const D3DXVECTOR2& tex)
{
	// テクスチャを代入する
	m_tex = tex;
}

//===========================================
// テクスチャの取得処理
//===========================================
D3DXVECTOR2 CScroll::GetTex(void) const
{
	// テクスチャ座標を返す
	return m_tex;
}

//===========================================
// 速度の設定処理
//===========================================
void CScroll::SetSpeed(const D3DXVECTOR2& speed)
{
	// 速度を設定する
	m_speed = speed;
}