//===========================================
//
// サンプルのメイン処理[sample.cpp]
// Author 小原立暉
//
//===========================================
//*******************************************
// インクルードファイル
//*******************************************
#include "main.h"
#include "manager.h"
#include "sample.h"
#include "sample_manager.h"

//-------------------------------------------
// マクロ定義
//-------------------------------------------

//-------------------------------------------
// 静的メンバ変数宣言
//-------------------------------------------

//==============================
// コンストラクタ
//==============================
CSample::CSample() : CObject/*親クラス*/(/*ここにタイプを入れる*/CObject::TYPE_NONE, /*ここに優先順位を入れる*/CObject::PRIORITY_BG)
{
	// 全ての値をクリアする
}

//==============================
// デストラクタ
//==============================
CSample::~CSample()
{

}

//==============================
// 破片の初期化処理
//==============================
HRESULT CSample::Init(void)
{
	//if (FAILED(親クラス::Init()))
	//{ // 初期化処理に失敗した場合

	//	// 失敗を返す
	//	return E_FAIL;
	//}

	// 全ての値を初期化する

	// 値を返す
	return S_OK;
}

//========================================
// 破片の終了処理
//========================================
void CSample::Uninit(void)
{
	//// 終了処理
	//親クラス::Uninit();
}

//=====================================
// 破片の更新処理
//=====================================
void CSample::Update(void)
{

}

//=====================================
// 破片の描画処理
//=====================================
void CSample::Draw(void)
{
	//// 描画処理
	//親クラス::Draw();
}

//=====================================
// 情報の設定処理
//=====================================
void CSample::SetData(void/*基本Createと同じ引数を入れる*/)
{
	// 設定処理に便利なマクロ定義
	//NONE_D3DXVECTOR3					// 向きを傾けない時とかに使用する
	//NONE_SCALE						// 拡大率を変更しないときとかに使う
	// 情報の設定処理

	//==========================================================================
	// 2Dポリゴン
	//==========================================================================
	//SetPos(位置を入れる);			// 位置
	//SetPosOld(位置を入れる);		// 前回の位置
	//SetRot(向きを入れる);			// 向き
	//SetSize(サイズを入れる);		// サイズ
	//SetLength(引数無し);			// 長さ
	//SetAngle(引数無し);			// 方向
	//BindTexture(CManager::Get()->GetTexture()->Regist(テクスチャの名前));		// テクスチャの割り当て処理

	//// 頂点座標の設定処理
	//SetVertex();

	//==========================================================================
	// 3Dポリゴン
	//==========================================================================
	//SetPos(位置を入れる);			// 位置
	//SetPosOld(位置を入れる);		// 前回の位置
	//SetRot(向きを入れる);			// 向き
	//SetSize(サイズを入れる);		// サイズ
	//BindTexture(CManager::Get()->GetTexture()->Regist(テクスチャの名前));		// テクスチャの割り当て処理

	//// 頂点座標の設定処理
	//SetVertex();

	//==========================================================================
	// ビルボード
	//==========================================================================
	//SetPos(位置を入れる);			// 位置
	//SetPosOld(位置を入れる);		// 前回の位置
	//SetSize(サイズを入れる);		// サイズ
	//BindTexture(CManager::Get()->GetTexture()->Regist(テクスチャの名前));		// テクスチャの割り当て処理

	//// 頂点座標の設定処理
	//SetVertex();

	//==========================================================================
	// アニメーション系
	//==========================================================================
	//SetPos(位置を入れる);			// 位置
	//SetPosOld(位置を入れる);		// 前回の位置
	//SetRot(向きを入れる);			// 向き
	//SetSize(サイズを入れる);		// サイズ
	//SetLength(引数無し);			// 長さ
	//SetAngle(引数無し);			// 方向
	//BindTexture(CManager::Get()->GetTexture()->Regist(テクスチャの名前));		// テクスチャの割り当て処理

	// アニメーションの設定処理
	//SetAnim(カウントを入れる, パターン数を入れる);

	//// 頂点座標の設定処理
	//SetVertex();

	// テクスチャの設定(アニメーションバージョン)
	//SetVtxTextureAnim(アニメーションの総パターン数を入れる, 0);

	//==========================================================================
	// モデル
	//==========================================================================
	//SetPos(位置を入れる);					// 位置
	//SetPosOld(位置を入れる);				// 前回の位置
	//SetRot(向きを入れる);					// 向き
	//SetScale(拡大率を入れる);				// 拡大率
	//SetFileData(モデルの種類を入れる);	// モデルの情報
}

//=======================================
// 生成処理
//=======================================
CSample* CSample::Create(void/*引数を入れる*/)
{
	// ローカルオブジェクトを生成
	CSample* pSample = nullptr;	// サンプルのインスタンスを生成

	if (pSample == nullptr)
	{ // オブジェクトが NULL の場合

		// インスタンスを生成
		pSample = new CSample;
	}
	else
	{ // オブジェクトが NULL じゃない場合

		// 停止
		assert(false);

		// NULL を返す
		return nullptr;
	}

	if (pSample != nullptr)
	{ // オブジェクトが NULL じゃない場合

		// 初期化処理
		if (FAILED(pSample->Init()))
		{ // 初期化に失敗した場合

			// 停止
			assert(false);

			// NULL を返す
			return nullptr;
		}

		// 情報の設定処理
		pSample->SetData(/*引数*/);
	}
	else
	{ // オブジェクトが NULL の場合

		// 停止
		assert(false);

		// NULL を返す
		return nullptr;
	}

	// サンプルのポインタを返す
	return pSample;
}

//====================================================================================================================================================================================================================================================
// ここからはマネージャーがある奴(マネージャーは当たり判定などで使う)
//====================================================================================================================================================================================================================================================

//================================
// コンストラクタ
//================================
CListSample::CListSample() : CObject/*親クラス*/(/*ここにタイプを入れる*/CObject::TYPE_NONE, /*ここに優先順位を入れる*/CObject::PRIORITY_BG)
{
	// 全ての値をクリアする
	m_pPrev = nullptr;		// 前のへのポインタ
	m_pNext = nullptr;		// 次のへのポインタ

	if (CSampleManager::Get() != nullptr)
	{ // マネージャーが存在していた場合

		// マネージャーへの登録処理
		CSampleManager::Get()->Regist(this);
	}
}

//================================
// デストラクタ
//================================
CListSample::~CListSample()
{

}

//============================
// 前のポインタの設定処理
//============================
void CListSample::SetPrev(CListSample* pPrev)
{
	// 前のポインタを設定する
	m_pPrev = pPrev;
}

//============================
// 後のポインタの設定処理
//============================
void CListSample::SetNext(CListSample* pNext)
{
	// 次のポインタを設定する
	m_pNext = pNext;
}

//============================
// 前のポインタの設定処理
//============================
CListSample* CListSample::GetPrev(void) const
{
	// 前のポインタを返す
	return m_pPrev;
}

//============================
// 次のポインタの設定処理
//============================
CListSample* CListSample::GetNext(void) const
{
	// 次のポインタを返す
	return m_pNext;
}

//================================
// 初期化処理
//================================
HRESULT CListSample::Init(void)
{
	//if (FAILED(親クラス::Init()))
	//{ // 初期化処理に失敗した場合

	//	// 失敗を返す
	//	return E_FAIL;
	//}

	// 全ての値を初期化する

	// 成功を返す
	return S_OK;
}

//================================
// 終了処理
//================================
void CListSample::Uninit(void)
{
	//// 終了処理
	//親クラス::Uninit();

	if (CSampleManager::Get() != nullptr)
	{ // マネージャーが存在していた場合

		// リスト構造の引き抜き処理
		CSampleManager::Get()->Pull(this);
	}

	// リスト構造関係のポインタを NULL にする
	m_pPrev = nullptr;
	m_pNext = nullptr;
}

//================================
// 更新処理
//================================
void CListSample::Update(void)
{

}

//================================
// 描画処理
//================================
void CListSample::Draw(void)
{
	//// 描画処理
	//親クラス::Draw();
}

//================================
// 情報の設定処理
//================================
void CListSample::SetData(void/*基本Createと同じ引数を入れる*/)
{
	// 設定処理に便利なマクロ定義
	//NONE_D3DXVECTOR3					// 向きを傾けない時とかに使用する
	//NONE_SCALE						// 拡大率を変更しないときとかに使う
	// 情報の設定処理

	//==========================================================================
	// 2Dポリゴン
	//==========================================================================
	//SetPos(位置を入れる);			// 位置
	//SetPosOld(位置を入れる);		// 前回の位置
	//SetRot(向きを入れる);			// 向き
	//SetSize(サイズを入れる);		// サイズ
	//SetLength(引数無し);			// 長さ
	//SetAngle(引数無し);			// 方向
	//BindTexture(CManager::Get()->GetTexture()->Regist(テクスチャの名前));		// テクスチャの割り当て処理

	//// 頂点座標の設定処理
	//SetVertex();

	//==========================================================================
	// 3Dポリゴン
	//==========================================================================
	//SetPos(位置を入れる);			// 位置
	//SetPosOld(位置を入れる);		// 前回の位置
	//SetRot(向きを入れる);			// 向き
	//SetSize(サイズを入れる);		// サイズ
	//BindTexture(CManager::Get()->GetTexture()->Regist(テクスチャの名前));		// テクスチャの割り当て処理

	//// 頂点座標の設定処理
	//SetVertex();

	//==========================================================================
	// ビルボード
	//==========================================================================
	//SetPos(位置を入れる);			// 位置
	//SetPosOld(位置を入れる);		// 前回の位置
	//SetSize(サイズを入れる);		// サイズ
	//BindTexture(CManager::Get()->GetTexture()->Regist(テクスチャの名前));		// テクスチャの割り当て処理

	//// 頂点座標の設定処理
	//SetVertex();

	//==========================================================================
	// アニメーション系
	//==========================================================================
	//SetPos(位置を入れる);			// 位置
	//SetPosOld(位置を入れる);		// 前回の位置
	//SetRot(向きを入れる);			// 向き
	//SetSize(サイズを入れる);		// サイズ
	//SetLength(引数無し);			// 長さ
	//SetAngle(引数無し);			// 方向
	//BindTexture(CManager::Get()->GetTexture()->Regist(テクスチャの名前));		// テクスチャの割り当て処理

	// アニメーションの設定処理
	//SetAnim(カウントを入れる, パターン数を入れる);

	//// 頂点座標の設定処理
	//SetVertex();

	// テクスチャの設定(アニメーションバージョン)
	//SetVtxTextureAnim(アニメーションの総パターン数を入れる, 0);

	//==========================================================================
	// モデル
	//==========================================================================
	//SetPos(位置を入れる);					// 位置
	//SetPosOld(位置を入れる);				// 前回の位置
	//SetRot(向きを入れる);					// 向き
	//SetScale(拡大率を入れる);				// 拡大率
	//SetFileData(モデルの種類を入れる);	// モデルの情報
}

//================================
// 生成処理
//================================
CListSample* CListSample::Create(void/*引数*/)
{
	// ローカルオブジェクトを生成
	CListSample* pList = nullptr;	// サンプルのインスタンスを生成

	if (pList == nullptr)
	{ // オブジェクトが NULL の場合

		// オブジェクトを生成
		pList = new CListSample;
	}
	else
	{ // オブジェクトが NULL じゃない場合

		// 停止
		assert(false);

		// NULL を返す
		return nullptr;
	}

	if (pList != nullptr)
	{ // オブジェクトが NULL じゃない場合

		// 情報の設定処理
		pList->SetData(/*引数*/);

		// 初期化処理
		if (FAILED(pList->Init()))
		{ // 初期化処理に失敗した場合

			// 停止
			assert(false);

			// NULL を返す
			return nullptr;
		}
	}
	else
	{ // オブジェクトが NULL の場合

		// 停止
		assert(false);

		// NULL を返す
		return nullptr;
	}

	// サンプルのポインタを返す
	return pList;
}